---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalResourceSubFolder
source: html/aa445af7-b5f6-ab25-4552-b9a5462a5a64.htm
---
# ExternalResourceSubFolder Members

Constructs a new ExternalResourceSubFolder with default values for folder name and icon path.